---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.LineLoadType
source: html/5a578d5c-cae2-21ba-83aa-ee4595ae48b4.htm
---
# LineLoadType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.